hiring/ticket_linking/app/controllers/tickets_controller.rb

  def create
    ticket = current_account.tickets.create(ticket_params)
---
INSERT INTO "accounts" ("slug", "created_at", "updated_at") VALUES (?, ?, ?)  [["slug", "default"], ["created_at", "2015-12-05 20:01:05.715127"], ["updated_at", "2015-12-05 20:01:05.715127"]]
INSERT INTO "tickets" ("subject", "account_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["subject", "foobar"], ["account_id", 1], ["created_at", "2015-12-05 20:01:05.716812"], ["updated_at", "2015-12-05 20:01:05.716812"]]

  def update
    ticket.update_attributes(ticket_params)
---
UPDATE "tickets" SET "subject" = ?, "updated_at" = ? WHERE "tickets"."id" = ?  [["subject", "This subject is updated now"], ["updated_at", "2015-12-05 19:56:06.832635"], ["id", 1]]

  def destroy
    ticket.destroy!
---
DELETE FROM "tickets" WHERE "tickets"."id" = ?  [["id", 1]]